#Область ПрограммныйИнтерфейс

// Функция - Пробег автотранспорта на дату по списку
//
// Параметры:
//  СписокАвтотранспорта - Массив<СправочникСсылка.УТЗ_ПЛ_Автотранспорт> - список автотранспорта 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить значения пробегов
// 
// Возвращаемое значение:
//  Соответствие -
//		Ключ - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//		Значение - число - пробег автотранспорта
//
Функция ПробегАвтотранспортаНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности = Неопределено) Экспорт
	Возврат УТЗ_ПЛ_Автотранспорт.ПробегАвтотранспортаНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности);
КонецФункции

// Функция - Пробег автотранспорта на дату по списку
//
// Параметры:
//  Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт - Автотранспорт
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить значения пробегов
// 
// Возвращаемое значение:
//  Число - пробег автотранспорта на дату
//
Функция ПробегАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт
	Возврат УТЗ_ПЛ_Автотранспорт.ПробегАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);	
КонецФункции

// Функция - Сведения об автотранспорте на дату по списку
//
// Параметры:
//  СписокАвтотранспорта - Массив - Массив элементов типа СправочникСсылка.УТЗ_ПЛ_Автотранспорт 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить сведения 
// 
// Возвращаемое значение:
//  Соответствие:
//		Ключ - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//		Значение - Структура:
//						* ВидАвтотранспорта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыАвтотранспорта
//						* Модель - СправочникСсылка.УТЗ_ПЛ_МоделиАвтотранспорта
//						* ВидПутевогоЛиста - ПеречислениеСсылка.УТЗ_ПЛ_ВидыПутевыхЛистов
//						* ДатаВводаВЭксплуатацию - Дата
//						* Возраст - Число
//						* ОсновнойВодитель - СправочникСсылка.УТЗ_ПЛ_Водители
//						* ПодразделениеВладелец - СправочникСсылка.СтруктураПредприятия
//						* Топливо - СправочникСсылка.УТЗ_ПЛ_Топливо
//						* Пробег - Число
//						* ОстатокТоплива - Число
//						* НормаРасходаОсновная - Число
//						* НормаРасходаДополнительнаяНаПеревозку - Число
//						* Моточасы - Число
Функция СведенияОбАвтотранспортеНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности = Неопределено) Экспорт
	Возврат УТЗ_ПЛ_Автотранспорт.СведенияОбАвтотранспортеНаДатуПоСписку(СписокАвтотранспорта, ДатаАктуальности);
КонецФункции

// Функция - Сведения об автотранспорте на дату
//
// Параметры:
//  Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт  - 
//  ДатаАктуальности	 - Дата - Дата, на которую необходимо получить сведения 
// 
// Возвращаемое значение:
//  Структура:
//		* ВидАвтотранспорта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыАвтотранспорта
//		* Модель - СправочникСсылка.УТЗ_ПЛ_МоделиАвтотранспорта
//		* ВидПутевогоЛиста - ПеречислениеСсылка.УТЗ_ПЛ_ВидыПутевыхЛистов
//		* ДатаВводаВЭксплуатацию - Дата
//		* Возраст - Число
//		* ОсновнойВодитель - СправочникСсылка.УТЗ_ПЛ_Водители
//		* ПодразделениеВладелец - СправочникСсылка.СтруктураПредприятия
//		* Топливо - СправочникСсылка.УТЗ_ПЛ_Топливо
//		* Пробег - Число
//		* ОстатокТоплива - Число
//		* НормаРасходаОсновная - Число
//		* НормаРасходаДополнительнаяНаПеревозку - Число
//		* Моточасы - Число
Функция СведенияОбАвтотранспортеНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт	
	Возврат УТЗ_ПЛ_Автотранспорт.СведенияОбАвтотранспортеНаДату(Автотранспорт, ДатаАктуальности);
КонецФункции

// Функция - Остаток топлива автотранспорта на дату
//
// Параметры:
//  Автотранспорт	 - СправочникСсылка.УТЗ_ПЛ_Автотранспорт - 
//  ДатаАктуальности - Дата	 - Если не задана, принимается текущая дата
// 
// Возвращаемое значение:
//  Число - Остаток топлива на дату
//
Функция ОстатокТопливаАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности = Неопределено) Экспорт
	
	Возврат УТЗ_ПЛ_Автотранспорт.ОстатокТопливаАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);
	
КонецФункции

// Функция - Нормативный расход топлива автотранспорта
//
// Параметры:
//  ПараметрыПолучения	 - 	Структура - Параметры, полученные с помощью метода УТЗ_ПЛ_АвтотранспортВызовСервера.ПараметрыПолученияНормативногоРасходаТоплива
//										* Автотранспорт 				- СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//										* Прицеп						- СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//										* СуммарнаяМассаГруза			- Число
//										* Расстояние					- Число
//										* КоэффициентНаселенногоПункта	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ
//										* КоэффициентКлассаДороги		- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ
//										* КоэффициентГорнойМестности	- ПеречислениеСсылка.УТЗ_ПЛ_ВидыКоэффициентовРасходаГСМ (не используется)
//  ДатаАктуальности	 - Дата - Дата актуальности получения данных 
// 
// Возвращаемое значение:
//  Число - нормативный расход автотранспорта
//
Функция НормативныйРасходТопливаАвтотранспорта(ПараметрыПолучения, ДатаАктуальности = Неопределено) Экспорт
	Возврат УТЗ_ПЛ_Автотранспорт.НормативныйРасходТопливаАвтотранспорта(ПараметрыПолучения, ДатаАктуальности);	
КонецФункции

// Функция - Параметры получения нормативного расхода топлива
// 
// Возвращаемое значение:
//  Структура - 
//			* Автотранспорт - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//			* Прицеп - СправочникСсылка.УТЗ_ПЛ_Автотранспорт
//			* СуммарнаяМассаГруза - Число
//			* Расстояние - Число
//			* КоэффициентНаселенногоПункта - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//			* КоэффициентКлассаДороги - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//			* (не используется) КоэффициентГорнойМестности - СправочникСсылка.УТЗ_ПЛ_КоэффициентыРасходаТоплива
//
Функция ПараметрыПолученияНормативногоРасходаТоплива() Экспорт
	Возврат УТЗ_ПЛ_Автотранспорт.ПараметрыПолученияНормативногоРасходаТоплива();
КонецФункции

#КонецОбласти
