
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАвтотранспорта

&НаКлиенте
Процедура СписокАвтотранспортаАвтотранспортПриИзменении(Элемент)
	
	ТекДанн = Элементы.СписокАвтотранспорта.ТекущиеДанные;
	ОстатокТоплива = 0;
	Если ЗначениеЗаполнено(ТекДанн.Автотранспорт) Тогда
		ОстатокТоплива = ОстатокТопливаАвтотранспорта(ТекДанн.Автотранспорт);	
	КонецЕсли;
	
	ТекДанн.ОстатокТекущий = ОстатокТоплива;
	РассчитатьСкорректированныйОстаток(ТекДанн);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаВидДвиженияПриИзменении(Элемент)
	РассчитатьСкорректированныйОстаток(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаКоличествоПриИзменении(Элемент)
	РассчитатьСкорректированныйОстаток(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОстатокТопливаАвтотранспорта(Автотранспорт)
	ДатаАктуальности = ДатаАктуальностиПолученияДанных();
	Возврат УТЗ_ПЛ_АвтотранспортВызовСервера.ОстатокТопливаАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);
КонецФункции

&НаКлиенте
Процедура РассчитатьСкорректированныйОстаток(ТекСтрока)
	
	ОстатокСкорректированный = ТекСтрока.ОстатокТекущий;
	
	Если ТекСтрока.ВидДвижения = ВидДвиженияКорректировокПриход() Тогда
		ОстатокСкорректированный = ТекСтрока.ОстатокТекущий + ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ВидДвижения = ВидДвиженияКорректировокРасход() Тогда
		ОстатокСкорректированный = ТекСтрока.ОстатокТекущий - ТекСтрока.Количество;
	КонецЕсли;
	
	ТекСтрока.ОстатокСкорректированный = ОстатокСкорректированный;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокПриход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокРасход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход;
КонецФункции

&НаКлиенте
Функция ДатаАктуальностиПолученияДанных()
	ДатаАктуальности = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	Возврат ДатаАктуальности;
КонецФункции

#КонецОбласти