
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАвтотранспорта

&НаКлиенте
Процедура СписокАвтотранспортаАвтотранспортПриИзменении(Элемент)
	
	ТекДанн = Элементы.СписокАвтотранспорта.ТекущиеДанные;
	Пробег = 0;
	Если ЗначениеЗаполнено(ТекДанн.Автотранспорт) Тогда
		Пробег = ПробегАвтотранспорта(ТекДанн.Автотранспорт);	
	КонецЕсли;
	
	ТекДанн.ПробегТекущий = Пробег;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаВидДвиженияПриИзменении(Элемент)
	РассчитатьСкорректированныйПробег(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаКоличествоПриИзменении(Элемент)
	РассчитатьСкорректированныйПробег(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПробегАвтотранспорта(Автотранспорт)
	ДатаАктуальности = ДатаАктуальностиПолученияДанных();
	Возврат УТЗ_ПЛ_АвтотранспортВызовСервера.ПробегАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);
КонецФункции

&НаКлиенте
Процедура РассчитатьСкорректированныйПробег(ТекСтрока)
	
	ПробегСкорректированный = ТекСтрока.ПробегТекущий;
	
	Если ТекСтрока.ВидДвижения = ВидДвиженияКорректировокПриход() Тогда
		ПробегСкорректированный = ТекСтрока.ПробегТекущий + ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ВидДвижения = ВидДвиженияКорректировокРасход() Тогда
		ПробегСкорректированный = ТекСтрока.ПробегТекущий - ТекСтрока.Количество;
	КонецЕсли;
	
	ТекСтрока.ПробегСкорректированный = ПробегСкорректированный;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокПриход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокРасход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход;
КонецФункции

&НаКлиенте
Функция ДатаАктуальностиПолученияДанных()
	ДатаАктуальности = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	Возврат ДатаАктуальности;
КонецФункции

#КонецОбласти