
//#Область ПрограммныйИнтерфейс

//Функция ПараметрыЗаполненияШапкиДокумента() Экспорт

//	Структура = Новый Структура;
//	Структура.Вставить("Подразделение");
//	Структура.Вставить("Склад");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	
//КонецФункции

//Функция ПараметрыЗаполненияСтрокиТовары() Экспорт

//	Структура = Новый Структура;
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	Структура.Вставить("");
//	
//КонецФункции

//#КонецОбласти