#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьМаскуВвода = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьМаскуВводаПриИзменении(Элемент)
	
	Если ИспользоватьМаскуВвода Тогда 
		Элементы.ГосНомер.Маска = "@ 999 @@ 999";
	Иначе 
		Элементы.ГосНомер.Маска = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПредставленияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьТекущиеКоэффициентыРасхода(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Автотранспорт", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор
	, 
	, 
	, 
	, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВодителяОсновным(Команда)
	
	ТекДанн = Элементы.СписокВодителей.ТекущиеДанные;
	
	Для Каждого Строка Из Объект.СписокВодителей Цикл
		Строка.ЭтоОсновнойВодитель = Ложь;
	КонецЦикла;
	
	ТекДанн.ЭтоОсновнойВодитель = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормыРасходаТоплива(Команда)
	Отбор = Новый Структура("Автотранспорт", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор
	, 
	, 
	, 
	, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	МаркаМодели = МаркаМоделиАвтотранспорта(Объект.Модель);
	
	Если ЗначениеЗаполнено(Объект.ГосНомер) Тогда
		Объект.Наименование = СтрШаблон("%1 %2, г/н %3", МаркаМодели, Объект.Модель, Объект.ГосНомер);
	Иначе
		Объект.Наименование = "" + МаркаМодели + " " + Объект.Модель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДополнениеПредставления) Тогда 
		Объект.Наименование = "" + Объект.Наименование + " [" + Объект.ДополнениеПредставления + "]";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаркаМоделиАвтотранспорта(МодельАвтотранспорта)
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МодельАвтотранспорта, "Марка", Истина); // ссылка, поля, разрешенные
КонецФункции


#КонецОбласти