///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с пунктами маршрута
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Функция - Возвращает данные о времени ездки и расстоянии между пунктами маршрута для автотранспорта
//
// Параметры:
//  Автотранспорт	 - СправочникСсылка.УТЗ_ПЛ_Автотранспорт 	 - 
//  ПунктУбытия		 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
//  ПунктПрибытия	 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
// 
// Возвращаемое значение:
//  Структура:
//		* ВремяВПути - Дата - Если данные не найдены, возвращается пустая дата
//		* Расстояние - Число - Если данные не найдены, возвращается 0
//	
Функция ВремяРасстояниеМеждуПунктамиМаршрута(Автотранспорт, ПунктУбытия, ПунктПрибытия) Экспорт
	
	ПараметрыОтвета = Новый Структура;
	ПараметрыОтвета.Вставить("ВремяВПути", Дата(1, 1, 1));
	ПараметрыОтвета.Вставить("Расстояние", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Расстояние КАК Расстояние,
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Время КАК ВремяВПути
		|ИЗ
		|	РегистрСведений.УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами КАК УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами
		|ГДЕ
		|	УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Автотранспорт = &Автотранспорт
		|	И УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Пункт1 = &Пункт1
		|	И УТЗ_ПЛ_ВремяРасстояниеМеждуПунктами.Пункт2 = &Пункт2";
	
	Запрос.УстановитьПараметр("Автотранспорт", Автотранспорт);
	Запрос.УстановитьПараметр("Пункт1", ПунктУбытия);
	Запрос.УстановитьПараметр("Пункт2", ПунктПрибытия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ПараметрыОтвета, Выборка);
	КонецЕсли;
	
	Возврат ПараметрыОтвета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти