///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с пунктами маршрута
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Возвращает данные о времени ездки и расстоянии между пунктами маршрута для автотранспорта
//
// Параметры:
//  Автотранспорт	 - СправочникСсылка.УТЗ_ПЛ_Автотранспорт 	 - 
//  ПунктУбытия		 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
//  ПунктПрибытия	 - СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута	 - 
// 
// Возвращаемое значение:
//  Структура:
//		* ВремяВПути - Дата - Если данные не найдены, возвращается пустая дата
//		* Расстояние - Число - Если данные не найдены, возвращается 0
//	
Функция ВремяРасстояниеМеждуПунктамиМаршрута(Автотранспорт, ПунктУбытия, ПунктПрибытия) Экспорт
	
	Возврат УТЗ_ПЛ_ПунктыМаршрута.ВремяРасстояниеМеждуПунктамиМаршрута(Автотранспорт, ПунктУбытия, ПунктПрибытия);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти