
&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОткрытаПоСценарию", Истина);
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", АдресПартнера());
	ПараметрыФормы.Вставить("Представление", Объект.Адрес);
	ПараметрыФормы.Вставить("Значение", Объект.Значение);
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса"
		, ПараметрыФормы
		, Элементы.Адрес
		, УникальныйИдентификатор
		,
		,
		,
		,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаСервереБезКонтекста
Функция АдресПартнера()
	Возврат Справочники.ВидыКонтактнойИнформации.АдресПартнера;
КонецФункции

&НаКлиенте
Процедура АдресОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.Адрес = ВыбранноеЗначение.Представление;
		Объект.Значение = ВыбранноеЗначение.Значение;
	КонецЕсли;
	
	
КонецПроцедуры
