

////////////////////////////////////////////////////////////////////////////////
// Параметры:
//	УстановитьОтборПоПутевомуЛисту - Булево - определяет первоначальное значение флажка
//  										  "ПоказыватьТолькоНеобеспеченные"
////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.УстановитьОтборПоПутевомуЛисту Тогда
		ПоказыватьТолькоНеобеспеченные = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыДинамическогоСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьТолькоНеобеспеченныеПриИзменении(Элемент)
	УстановитьПараметрыДинамическогоСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьТолькоНеобеспеченные", ПоказыватьТолькоНеобеспеченные);
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
