
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	СформироватьНаименование();
	Объект.ФамилияИО = ФамилияИнициалыФизическогоЛица(Объект.ФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ТабельныйНомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПредставленияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСписокДокументовВодителя(Команда)
	
	Отбор = Новый Структура("Водитель", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_ДокументыВодителей.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
		Объект.Наименование = Объект.ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТабельныйНомер) Тогда 
		Объект.Наименование = Объект.Наименование + " " + Объект.ТабельныйНомер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДополнениеПредставления) Тогда 
		Объект.Наименование = Объект.Наименование + " [" + Объект.ДополнениеПредставления + "]";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФамилияИнициалыФизическогоЛица(ФизическоеЛицо)
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");	
	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);
КонецФункции

#КонецОбласти