///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
Функция НастройкиПутевыхЛистовНаДату(ДатаАктуальности = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.Период КАК Период,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ВремяНачалаРаботы КАК ВремяНачалаРаботы,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ВремяОкончанияРаботы КАК ВремяОкончанияРаботы,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаВозрастаПробега1 КАК ЗначениеКоэффициентаВозрастаПробега1,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаВозрастаПробега2 КАК ЗначениеКоэффициентаВозрастаПробега2,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаКлассаДороги КАК ЗначениеКоэффициентаКлассаДороги,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаКондиционера КАК ЗначениеКоэффициентаКондиционера,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаНаселенногоПункта КАК ЗначениеКоэффициентаНаселенногоПункта,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ЗначениеКоэффициентаСезонного КАК ЗначениеКоэффициентаСезонного,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентВозрастаПробега1 КАК КоэффициентВозрастаПробега1,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентВозрастаПробега2 КАК КоэффициентВозрастаПробега2,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентКлассаДороги КАК КоэффициентКлассаДороги,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентКондиционера КАК КоэффициентКондиционера,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентНаселенногоПункта КАК КоэффициентНаселенногоПункта,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.КоэффициентСезонный КАК КоэффициентСезонный,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.МестоПарковкиГрузовогоАвтотранспорта КАК МестоПарковкиГрузовогоАвтотранспорта,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.МестоПарковкиЛегковогоАвтотранспорта КАК МестоПарковкиЛегковогоАвтотранспорта,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьВозрастПробег КАК УчитыватьВозрастПробег,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьКлассДороги КАК УчитыватьКлассДороги,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьКондиционер КАК УчитыватьКондиционер,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьРазмерНаселенногоПункта КАК УчитыватьРазмерНаселенногоПункта,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.УчитыватьСезонныйКоэффициент КАК УчитыватьСезонныйКоэффициент,
		|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.УТЗ_ПЛ_НастройкиПутевыхЛистов.СрезПоследних(&ДатаАктуальности, ) КАК УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	СтрокаНастройки = ТЗ.Получить(0);
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаНастройки);
	
КонецФункции

// Функция - Текущее место парковки легкового автотранспорта
// 
// Возвращаемое значение:
//  СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута - место парковки
//
Функция ТекущееМестоПарковкиЛегковогоАвтотранспорта() Экспорт
	
	МестоПарковки = Справочники.УТЗ_ПЛ_ПунктыМаршрута.ПустаяСсылка();
	
	Настройки = НастройкиПутевыхЛистовНаДату();
	Если Настройки <> Неопределено Тогда
		МестоПарковки = Настройки.МестоПарковкиЛегковогоАвтотранспорта;
	КонецЕсли;
	
	Возврат МестоПарковки;
	
КонецФункции

// Функция - Текущее место парковки грузового автотранспорта
// 
// Возвращаемое значение:
//  СправочникСсылка.УТЗ_ПЛ_ПунктыМаршрута - место парковки
//
Функция ТекущееМестоПарковкиГрузовогоАвтотранспорта() Экспорт
	
	МестоПарковки = Справочники.УТЗ_ПЛ_ПунктыМаршрута.ПустаяСсылка();
	
	Настройки = НастройкиПутевыхЛистовНаДату();
	Если Настройки <> Неопределено Тогда
		МестоПарковки = Настройки.МестоПарковкиГрузовогоАвтотранспорта;
	КонецЕсли;
	
	Возврат МестоПарковки;
	
КонецФункции

// Функция - Время начала работы
// 
// Возвращаемое значение:
//  Дата - Время начала работы на текущую дату
//
Функция ВремяНачалаРаботы() Экспорт 
	
	ДатаАктуальности = ТекущаяДатаСеанса();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних.ВремяНачалаРаботы КАК ВремяНачалаРаботы
	|ИЗ
	|	РегистрСведений.УТЗ_ПЛ_НастройкиПутевыхЛистов.СрезПоследних(&ДатаАктуальности, ) КАК УТЗ_ПЛ_НастройкиПутевыхЛистовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Дата(1, 1, 1, 8, 0, 0);
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВремяНачалаРаботы;
	
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти